index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2024-09-04 mié 23:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Apuntes Graficación</title>
<meta name="author" content="likcos" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Apuntes Graficación</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org63edfef">Manual de Instalación de Git</a>
<ul>
<li><a href="#org3adf2af">Instalación en Windows</a></li>
<li><a href="#org15850ec">Instalación en macOS</a>
<ul>
<li><a href="#org33dcd39">Método recomendado: usando Homebrew</a></li>
<li><a href="#orgd565ca1">Método alternativo: paquete descargado</a></li>
</ul>
</li>
<li><a href="#orgd48f840">Instalación en Linux (Distribuciones basadas en Debian/Ubuntu)</a></li>
<li><a href="#org01e633c">Configuración básica de Git</a></li>
<li><a href="#orga7ba1b9">Actualización de Git</a></li>
<li><a href="#org0cbb99b">Configurar Llave SSH con GitHub</a>
<ul>
<li><a href="#orgaaec18b">1. Verificar si ya tienes una llave SSH</a></li>
<li><a href="#org7636dd0">2. Generar una nueva llave SSH</a></li>
<li><a href="#org7bd2256">3. Añadir la llave SSH al agente SSH</a></li>
<li><a href="#org0c03900">4. Copiar la llave SSH pública</a></li>
<li><a href="#org59d6b0a">5. Añadir la llave SSH a GitHub</a></li>
<li><a href="#orga816612">6. Probar la conexión SSH con GitHub</a></li>
<li><a href="#org372eacc">7. Usar la conexión SSH en repositorios de GitHub</a></li>
</ul>
</li>
<li><a href="#org58f784e">Configurar Llave SSH con GitHub en Windows</a>
<ul>
<li><a href="#org677e172">1. Abrir Git Bash</a></li>
<li><a href="#orgf3160ba">2. Verificar si ya tienes una llave SSH</a></li>
<li><a href="#org37e7043">3. Generar una nueva llave SSH</a></li>
<li><a href="#org38f7305">4. Añadir la llave SSH al agente SSH</a></li>
<li><a href="#orgf3d54d9">5. Copiar la llave SSH pública</a></li>
<li><a href="#org8ccf5c4">6. Añadir la llave SSH a GitHub</a></li>
<li><a href="#org5016e4b">7. Probar la conexión SSH con GitHub</a></li>
<li><a href="#org306aab8">8. Usar la conexión SSH en repositorios de GitHub</a></li>
</ul>
</li>
<li><a href="#orgeb057bc">Manual de Git en Windows</a>
<ul>
<li><a href="#org980b6d1">1. Instalar Git en Windows</a></li>
<li><a href="#orgb28bc2a">2. Configurar Git</a></li>
<li><a href="#org8b65b48">3. Clonar un repositorio</a></li>
<li><a href="#org606d559">4. Comandos básicos de Git</a></li>
<li><a href="#org42c52bb">5. Actualizar el repositorio local</a></li>
<li><a href="#org07f5937">6. Crear y cambiar de ramas (branches)</a></li>
<li><a href="#orgbd517e9">7. Ver historial de commits</a></li>
<li><a href="#orga91b2ee">8. Configurar una llave SSH</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org769eea0">Graficación por Computadora</a>
<ul>
<li><a href="#org535f596">Objetivos de la Graficación por Computadora</a></li>
<li><a href="#orgbb6f13f">Áreas de estudio en Graficación por Computadora</a></li>
<li><a href="#orga1547e0">Aplicaciones de la Graficación por Computadora</a></li>
<li><a href="#orgc82b6b4">Temas principales en Graficación por Computadora</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org63edfef" class="outline-2">
<h2 id="org63edfef">Manual de Instalación de Git</h2>
<div class="outline-text-2" id="text-org63edfef">
</div>
<div id="outline-container-org3adf2af" class="outline-3">
<h3 id="org3adf2af">Instalación en Windows</h3>
<div class="outline-text-3" id="text-org3adf2af">
<ul class="org-ul">
<li>Descarga el instalador desde [<a href="https://git-scm.com/">https://git-scm.com/</a>].</li>
</ul>



<ul class="org-ul">
<li>Haz clic en el botón “Download for Windows”.
<ul class="org-ul">
<li>Ejecuta el archivo descargado (.exe).</li>

<li>Configuración de las opciones recomendadas durante la instalación:
<ul class="org-ul">
<li>Seleccionar el editor por defecto (por ejemplo, Vim o Notepad++).</li>
<li>Usar Git desde la línea de comandos y aplicaciones de terceros (opción recomendada).</li>
<li>Opciones de formato de fin de línea: selecciona la opción predeterminada para Windows.</li>
</ul></li>

<li>Completa la instalación.</li>
<li><p>
Verifica la instalación abriendo Git Bash o Command Prompt y ejecutando:
</p>
<div class="org-src-container">
<pre class="src src-bash">     git --version
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org15850ec" class="outline-3">
<h3 id="org15850ec">Instalación en macOS</h3>
<div class="outline-text-3" id="text-org15850ec">
</div>
<div id="outline-container-org33dcd39" class="outline-4">
<h4 id="org33dcd39">Método recomendado: usando Homebrew</h4>
<div class="outline-text-4" id="text-org33dcd39">
<ul class="org-ul">
<li><p>
Si tienes Homebrew instalado, abre la terminal y ejecuta:
</p>
<div class="org-src-container">
<pre class="src src-bash">     brew install git
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgd565ca1" class="outline-4">
<h4 id="orgd565ca1">Método alternativo: paquete descargado</h4>
<div class="outline-text-4" id="text-orgd565ca1">
<ul class="org-ul">
<li>Descarga el instalador desde [<a href="https://git-scm.com/">https://git-scm.com/</a>].</li>
<li>Ejecuta el paquete descargado (.dmg).</li>
<li>Sigue las instrucciones de instalación.</li>

<li><p>
Verifica la instalación abriendo la terminal y ejecutando:
</p>
<div class="org-src-container">
<pre class="src src-bash">     git --version
</pre>
</div></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd48f840" class="outline-3">
<h3 id="orgd48f840">Instalación en Linux (Distribuciones basadas en Debian/Ubuntu)</h3>
<div class="outline-text-3" id="text-orgd48f840">
<ul class="org-ul">
<li><p>
Abre la terminal y ejecuta:
</p>
<div class="org-src-container">
<pre class="src src-bash">     sudo apt update
     sudo apt install git
</pre>
</div></li>

<li><p>
Verifica la instalación ejecutando:
</p>
<div class="org-src-container">
<pre class="src src-bash">     git --version
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org01e633c" class="outline-3">
<h3 id="org01e633c">Configuración básica de Git</h3>
<div class="outline-text-3" id="text-org01e633c">
<ul class="org-ul">
<li><p>
Configura tu nombre de usuario:
</p>
<div class="org-src-container">
<pre class="src src-bash">     git config --global user.name <span style="color: #c3e88d;">"Tu Nombre"</span>
</pre>
</div></li>

<li><p>
Configura tu correo electrónico:
</p>
<div class="org-src-container">
<pre class="src src-bash">     git config --global user.email <span style="color: #c3e88d;">"tuemail@ejemplo.com"</span>
</pre>
</div></li>

<li><p>
Verifica la configuración:
</p>
<div class="org-src-container">
<pre class="src src-bash">     git config --list
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orga7ba1b9" class="outline-3">
<h3 id="orga7ba1b9">Actualización de Git</h3>
<div class="outline-text-3" id="text-orga7ba1b9">
<ul class="org-ul">
<li><b><b>Windows</b></b>: Ejecuta el instalador más reciente desde el sitio oficial.</li>
<li><p>
<b><b>macOS</b></b>: Ejecuta:
</p>
<div class="org-src-container">
<pre class="src src-bash">     brew upgrade git
</pre>
</div></li>
<li><p>
<b><b>Linux</b></b>: Ejecuta:
</p>
<div class="org-src-container">
<pre class="src src-bash">     sudo apt update &amp;&amp; sudo apt upgrade git
</pre>
</div></li>
</ul>
</div>
</div>



<div id="outline-container-org0cbb99b" class="outline-3">
<h3 id="org0cbb99b">Configurar Llave SSH con GitHub</h3>
<div class="outline-text-3" id="text-org0cbb99b">
</div>
<div id="outline-container-orgaaec18b" class="outline-4">
<h4 id="orgaaec18b">1. Verificar si ya tienes una llave SSH</h4>
<div class="outline-text-4" id="text-orgaaec18b">
<ul class="org-ul">
<li><p>
Abre la terminal y ejecuta el siguiente comando para verificar si ya tienes llaves SSH generadas:
</p>
<div class="org-src-container">
<pre class="src src-bash">     ls -al ~/.ssh
</pre>
</div></li>

<li>Si ves archivos como `id<sub>rsa</sub>` o `id<sub>ed25519</sub>`, ya tienes llaves SSH. Si no, continúa con el siguiente paso.</li>
</ul>
</div>
</div>

<div id="outline-container-org7636dd0" class="outline-4">
<h4 id="org7636dd0">2. Generar una nueva llave SSH</h4>
<div class="outline-text-4" id="text-org7636dd0">
<ul class="org-ul">
<li><p>
Si no tienes una llave SSH, genera una nueva con el siguiente comando (puedes cambiar `ed25519` por `rsa` si lo prefieres):
</p>
<div class="org-src-container">
<pre class="src src-bash">     ssh-keygen -t ed25519 -C <span style="color: #c3e88d;">"tuemail@ejemplo.com"</span>
</pre>
</div></li>

<li>Cuando se te pregunte por la ubicación del archivo, presiona `Enter` para usar la ubicación predeterminada (`~/.ssh/id<sub>ed25519</sub>`).</li>
<li>Puedes agregar una contraseña para proteger tu llave, pero también puedes dejarlo en blanco.</li>
</ul>
</div>
</div>

<div id="outline-container-org7bd2256" class="outline-4">
<h4 id="org7bd2256">3. Añadir la llave SSH al agente SSH</h4>
<div class="outline-text-4" id="text-org7bd2256">
<ul class="org-ul">
<li><p>
Para añadir tu nueva llave SSH al agente, asegúrate de que esté en ejecución:
</p>
<div class="org-src-container">
<pre class="src src-bash">     <span style="color: #c099ff;">eval</span> <span style="color: #c3e88d;">"$(ssh-agent -s)"</span>
</pre>
</div></li>

<li><p>
Añade la llave SSH al agente:
</p>
<div class="org-src-container">
<pre class="src src-bash">     ssh-add ~/.ssh/id_ed25519
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org0c03900" class="outline-4">
<h4 id="org0c03900">4. Copiar la llave SSH pública</h4>
<div class="outline-text-4" id="text-org0c03900">
<ul class="org-ul">
<li><p>
Copia el contenido de tu llave pública para añadirla a GitHub:
</p>
<div class="org-src-container">
<pre class="src src-bash">     cat ~/.ssh/id_ed25519.pub
</pre>
</div></li>

<li>Copia el texto que aparece en la terminal (comienza con `ssh-ed25519` o `ssh-rsa`).</li>
</ul>
</div>
</div>

<div id="outline-container-org59d6b0a" class="outline-4">
<h4 id="org59d6b0a">5. Añadir la llave SSH a GitHub</h4>
<div class="outline-text-4" id="text-org59d6b0a">
<ul class="org-ul">
<li>Inicia sesión en tu cuenta de GitHub.</li>
<li>Ve a la sección de <b><b>Settings</b></b> (Configuración).</li>
<li>En el menú lateral izquierdo, selecciona <b><b>SSH and GPG keys</b></b>.</li>
<li>Haz clic en <b><b>New SSH key</b></b>.</li>
<li>Introduce un título para identificar la llave (por ejemplo, "Mi computadora personal") y pega la llave pública copiada en el campo correspondiente.</li>
<li>Haz clic en <b><b>Add SSH key</b></b>.</li>
</ul>
</div>
</div>
