index.html

<div id="outline-container-orga816612" class="outline-4">
<h4 id="orga816612">6. Probar la conexión SSH con GitHub</h4>
<div class="outline-text-4" id="text-orga816612">
<ul class="org-ul">
<li><p>
Para verificar que todo está configurado correctamente, ejecuta el siguiente comando:
</p>
<div class="org-src-container">
<pre class="src src-bash">     ssh -T git@github.com
</pre>
</div></li>

<li>Si es la primera vez que te conectas, verás una advertencia preguntando si deseas continuar. Escribe `yes`.</li>
<li><p>
Si la conexión es exitosa, verás un mensaje similar a:
</p>
<blockquote>
<p>
Hi username! You've successfully authenticated, but GitHub does not provide shell access.
</p>
</blockquote></li>
</ul>
</div>
</div>

<div id="outline-container-org372eacc" class="outline-4">
<h4 id="org372eacc">7. Usar la conexión SSH en repositorios de GitHub</h4>
<div class="outline-text-4" id="text-org372eacc">
<ul class="org-ul">
<li><p>
Para clonar un repositorio usando SSH, utiliza la URL SSH del repositorio:
</p>
<div class="org-src-container">
<pre class="src src-bash">     git clone git@github.com:usuario/repo.git
</pre>
</div></li>
</ul>
</div>
</div>
</div>



<div id="outline-container-org58f784e" class="outline-3">
<h3 id="org58f784e">Configurar Llave SSH con GitHub en Windows</h3>
<div class="outline-text-3" id="text-org58f784e">
<ol class="org-ol">
<li>Git Bash: En Windows, utilizas Git Bash como terminal para ejecutar los comandos, en lugar de la terminal estándar de Linux o macOS.</li>

<li>Ruta de las llaves: En Git Bash, las rutas siguen el formato Unix (<i>c/Users/tu<sub>usuario</sub></i>.ssh/ en lugar de C:\Users\tu<sub>usuario\.ssh</sub>).</li>
</ol>
</div>



<div id="outline-container-org677e172" class="outline-4">
<h4 id="org677e172">1. Abrir Git Bash</h4>
<div class="outline-text-4" id="text-org677e172">
<ul class="org-ul">
<li>Abre <b><b>Git Bash</b></b> (es la terminal que se instala junto con Git en Windows).</li>
</ul>
</div>
</div>

<div id="outline-container-orgf3160ba" class="outline-4">
<h4 id="orgf3160ba">2. Verificar si ya tienes una llave SSH</h4>
<div class="outline-text-4" id="text-orgf3160ba">
<ul class="org-ul">
<li><p>
En la terminal de Git Bash, ejecuta el siguiente comando para ver si ya tienes llaves SSH generadas:
</p>
<div class="org-src-container">
<pre class="src src-bash">     ls -al ~/.ssh
</pre>
</div></li>

<li>Si ves archivos como `id<sub>rsa</sub>` o `id<sub>ed25519</sub>`, ya tienes llaves SSH. Si no, continúa con el siguiente paso.</li>
</ul>
</div>
</div>

<div id="outline-container-org37e7043" class="outline-4">
<h4 id="org37e7043">3. Generar una nueva llave SSH</h4>
<div class="outline-text-4" id="text-org37e7043">
<ul class="org-ul">
<li><p>
Si no tienes una llave SSH, genera una nueva con el siguiente comando:
</p>
<div class="org-src-container">
<pre class="src src-bash">     ssh-keygen -t ed25519 -C <span style="color: #c3e88d;">"tuemail@ejemplo.com"</span>
</pre>
</div></li>

<li>Cuando se te pregunte por la ubicación del archivo, presiona `Enter` para usar la ubicación predeterminada (`/c/Users/tu<sub>usuario</sub>/.ssh/id<sub>ed25519</sub>`).</li>
<li>Puedes agregar una contraseña para proteger tu llave, pero también puedes dejar el campo vacío si no deseas protegerla con una contraseña.</li>
</ul>
</div>
</div>

<div id="outline-container-org38f7305" class="outline-4">
<h4 id="org38f7305">4. Añadir la llave SSH al agente SSH</h4>
<div class="outline-text-4" id="text-org38f7305">
<ul class="org-ul">
<li><p>
Asegúrate de que el agente SSH esté en ejecución. En Git Bash, ejecuta:
</p>
<div class="org-src-container">
<pre class="src src-bash">     <span style="color: #c099ff;">eval</span> <span style="color: #c3e88d;">"$(ssh-agent -s)"</span>
</pre>
</div></li>

<li><p>
Añade tu nueva llave SSH al agente:
</p>
<div class="org-src-container">
<pre class="src src-bash">     ssh-add ~/.ssh/id_ed25519
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgf3d54d9" class="outline-4">
<h4 id="orgf3d54d9">5. Copiar la llave SSH pública</h4>
<div class="outline-text-4" id="text-orgf3d54d9">
<ul class="org-ul">
<li><p>
Para añadir la llave SSH a GitHub, necesitas copiar tu llave pública. Ejecuta el siguiente comando en Git Bash:
</p>
<div class="org-src-container">
<pre class="src src-bash">     cat ~/.ssh/id_ed25519.pub
</pre>
</div></li>

<li>Copia el texto que aparece en la terminal, que comenzará con `ssh-ed25519` o `ssh-rsa`.</li>
</ul>
</div>
</div>

<div id="outline-container-org8ccf5c4" class="outline-4">
<h4 id="org8ccf5c4">6. Añadir la llave SSH a GitHub</h4>
<div class="outline-text-4" id="text-org8ccf5c4">
<ul class="org-ul">
<li>Abre tu navegador web e inicia sesión en GitHub.</li>
<li>Ve a la sección de <b><b>Settings</b></b> (Configuración).</li>
<li>En el menú lateral izquierdo, selecciona <b><b>SSH and GPG keys</b></b>.</li>
<li>Haz clic en <b><b>New SSH key</b></b>.</li>
<li>Ponle un título descriptivo (como "Mi computadora con Windows") y pega la llave pública copiada en el campo correspondiente.</li>
<li>Haz clic en <b><b>Add SSH key</b></b>.</li>
</ul>
</div>
</div>

<div id="outline-container-org5016e4b" class="outline-4">
<h4 id="org5016e4b">7. Probar la conexión SSH con GitHub</h4>
<div class="outline-text-4" id="text-org5016e4b">
<ul class="org-ul">
<li><p>
Para asegurarte de que todo está correctamente configurado, prueba la conexión con GitHub desde Git Bash:
</p>
<div class="org-src-container">
<pre class="src src-bash">     ssh -T git@github.com
</pre>
</div></li>

<li>Si es la primera vez que te conectas, te pedirá confirmar la conexión escribiendo `yes`.</li>
<li><p>
Si todo está bien, deberías ver un mensaje como:
</p>
<blockquote>
<p>
Hi username! You've successfully authenticated, but GitHub does not provide shell access.
</p>
</blockquote></li>
</ul>
</div>
</div>

<div id="outline-container-org306aab8" class="outline-4">
<h4 id="org306aab8">8. Usar la conexión SSH en repositorios de GitHub</h4>
<div class="outline-text-4" id="text-org306aab8">
<ul class="org-ul">
<li><p>
Para clonar un repositorio usando la URL SSH, ejecuta:
</p>
<div class="org-src-container">
<pre class="src src-bash">     git clone git@github.com:usuario/repo.git
</pre>
</div></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-orgeb057bc" class="outline-3">
<h3 id="orgeb057bc">Manual de Git en Windows</h3>
<div class="outline-text-3" id="text-orgeb057bc">
</div>
<div id="outline-container-org980b6d1" class="outline-4">
<h4 id="org980b6d1">1. Instalar Git en Windows</h4>
<div class="outline-text-4" id="text-org980b6d1">
<ul class="org-ul">
<li>Visita [<a href="https://git-scm.com/">https://git-scm.com/</a>](<a href="https://git-scm.com/">https://git-scm.com/</a>) y descarga el instalador de Git para Windows.</li>
<li>Ejecuta el archivo descargado (.exe).</li>
<li>Durante la instalación, selecciona las opciones predeterminadas recomendadas.</li>
<li>Abre <b><b>Git Bash</b></b> al finalizar la instalación.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb28bc2a" class="outline-4">
<h4 id="orgb28bc2a">2. Configurar Git</h4>
<div class="outline-text-4" id="text-orgb28bc2a">
<ul class="org-ul">
<li>Abre <b><b>Git Bash</b></b> y ejecuta los siguientes comandos para configurar tu identidad:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git config --global user.name <span style="color: #c3e88d;">"Tu Nombre"</span>
   git config --global user.email <span style="color: #c3e88d;">"tuemail@ejemplo.com"</span>
</pre>
</div>

<ul class="org-ul">
<li>Para verificar la configuración:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git config --list
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b65b48" class="outline-4">
<h4 id="org8b65b48">3. Clonar un repositorio</h4>
<div class="outline-text-4" id="text-org8b65b48">
<ul class="org-ul">
<li>Para clonar un repositorio desde GitHub, usa el siguiente comando:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git clone https://github.com/usuario/repo.git
</pre>
</div>

<p>
Esto descargará el repositorio a tu computadora.
</p>
</div>
</div>

<div id="outline-container-org606d559" class="outline-4">
<h4 id="org606d559">4. Comandos básicos de Git</h4>
<div class="outline-text-4" id="text-org606d559">
<ul class="org-ul">
<li><b><b>Verificar el estado del repositorio</b></b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git status
</pre>
</div>

<ul class="org-ul">
<li><b><b>Añadir archivos al área de preparación (staging)</b></b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git add nombre_de_archivo
</pre>
</div>

<ul class="org-ul">
<li>Para añadir todos los archivos modificados:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git add .
</pre>
</div>

<ul class="org-ul">
<li><b><b>Hacer un commit</b></b> (guardar los cambios localmente):</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git commit -m <span style="color: #c3e88d;">"Mensaje de commit"</span>
</pre>
</div>

<ul class="org-ul">
<li><b><b>Enviar los cambios al repositorio remoto</b></b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git push
</pre>
</div>
</div>
</div>

<div id="outline-container-org42c52bb" class="outline-4">
<h4 id="org42c52bb">5. Actualizar el repositorio local</h4>
<div class="outline-text-4" id="text-org42c52bb">
<ul class="org-ul">
<li>Para obtener los últimos cambios del repositorio remoto:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git pull
</pre>
</div>
</div>
</div>
