readme.org
*** 6. Crear y cambiar de ramas (branches)

   - **Crear una nueva rama**:

   #+BEGIN_SRC bash
   git branch nombre_de_la_rama
   #+END_SRC

   - **Cambiar a una rama existente**:

   #+BEGIN_SRC bash
   git checkout nombre_de_la_rama
   #+END_SRC

   - **Crear y cambiar a una nueva rama**:

   #+BEGIN_SRC bash
   git checkout -b nombre_de_la_rama
   #+END_SRC

*** 7. Ver historial de commits

   - Para ver el historial de cambios del repositorio:

   #+BEGIN_SRC bash
   git log
   #+END_SRC

   - Para un historial más compacto:

   #+BEGIN_SRC bash
   git log --oneline
   #+END_SRC

*** 8. Configurar una llave SSH

   - **Generar una llave SSH**:

   #+BEGIN_SRC bash
   ssh-keygen -t ed25519 -C "tuemail@ejemplo.com"
   #+END_SRC

   - **Añadir la llave al agente SSH**:

   #+BEGIN_SRC bash
   eval "$(ssh-agent -s)"
   ssh-add ~/.ssh/id_ed25519
   #+END_SRC

   - **Copiar la llave pública**:

   #+BEGIN_SRC bash
   cat ~/.ssh/id_ed25519.pub
   #+END_SRC

   - Añádela a tu cuenta de GitHub en **Settings > SSH and GPG keys**.

   

* Graficación por Computadora

La  Graficación por Computadora (o simplemente Graficación)
se enfoca en el estudio y aplicación de técnicas, algoritmos y
herramientas para la generación y manipulación de imágenes digitales
mediante el uso de computadoras. Es una rama de la informática que
combina conceptos de matemáticas, física y programación para crear
imágenes, animaciones y efectos visuales. A continuación, te describo
los aspectos clave de esta disciplina:

** Objetivos de la Graficación por Computadora
   1. **Generación de imágenes**: Crear imágenes digitales a partir de descripciones matemáticas y geométricas de objetos, en 2D y 3D.
   2. **Modelado de objetos**: Crear representaciones matemáticas de objetos y escenas usando técnicas como polígonos, mallas y curvas.
   3. **Renderizado**: Convertir representaciones matemáticas en imágenes visuales, simulando iluminación, sombras y texturas.
   4. **Transformaciones geométricas**: Aplicar traslaciones, rotaciones, escalados y proyecciones a objetos en sistemas de coordenadas 2D y 3D.
   5. **Iluminación y sombreado**: Simular cómo la luz interactúa con los objetos para crear efectos realistas.
   6. **Animación**: Generar secuencias de imágenes que cambian a lo largo del tiempo, incluyendo movimientos y simulaciones físicas.
   7. **Texturizado**: Aplicar imágenes (texturas) sobre superficies para dar detalles visuales sin aumentar la complejidad geométrica.
   8. **Interacción gráfica**: Estudiar técnicas para interactuar con imágenes o modelos gráficos, como interfaces gráficas, realidad aumentada o virtual.

** Áreas de estudio en Graficación por Computadora
   1. **Matemáticas**: Uso de geometría y álgebra lineal para realizar transformaciones geométricas y modelar objetos.
   2. **Programación**: Conocimiento de lenguajes como C++, Python, GLSL y HLSL para implementar algoritmos gráficos.
   3. **Algoritmos gráficos**: Estudio de algoritmos como el trazado de rayos (ray tracing), rasterización y z-buffering.
   4. **Herramientas gráficas**: Uso de APIs como OpenGL, DirectX o Vulkan para crear gráficos y animaciones.
   5. **Física aplicada**: Simulación de fenómenos físicos como gravedad y movimiento para generar gráficos realistas.

** Aplicaciones de la Graficación por Computadora
   - **Videojuegos**: Creación de ambientes, personajes y efectos visuales.
   - **Cine y efectos visuales**: Creación de efectos especiales y animación por computadora.
   - **Diseño industrial y arquitectónico**: Modelado y visualización de prototipos y estructuras.
   - **Simulaciones**: Uso en medicina, aeronáutica y otras industrias para crear simulaciones realistas.
   - **Realidad virtual y aumentada**: Generación de entornos interactivos virtuales.

** Temas principales en Graficación por Computadora
   - **Modelado 2D y 3D**
   - **Algoritmos de rasterización**
   - **Transformaciones y proyecciones**
   - **Renderizado y sombreado**
   - **Texturizado**
   - **Iluminación global y local**
   - **Técnicas de animación**
   - **Programación de shaders**
   - **Interacción gráfica y diseño de interfaces**
   
