index.html

<div id="outline-container-org07f5937" class="outline-4">
<h4 id="org07f5937">6. Crear y cambiar de ramas (branches)</h4>
<div class="outline-text-4" id="text-org07f5937">
<ul class="org-ul">
<li><b><b>Crear una nueva rama</b></b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git branch nombre_de_la_rama
</pre>
</div>

<ul class="org-ul">
<li><b><b>Cambiar a una rama existente</b></b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git checkout nombre_de_la_rama
</pre>
</div>

<ul class="org-ul">
<li><b><b>Crear y cambiar a una nueva rama</b></b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git checkout -b nombre_de_la_rama
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd517e9" class="outline-4">
<h4 id="orgbd517e9">7. Ver historial de commits</h4>
<div class="outline-text-4" id="text-orgbd517e9">
<ul class="org-ul">
<li>Para ver el historial de cambios del repositorio:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git log
</pre>
</div>

<ul class="org-ul">
<li>Para un historial más compacto:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git log --oneline
</pre>
</div>
</div>
</div>

<div id="outline-container-orga91b2ee" class="outline-4">
<h4 id="orga91b2ee">8. Configurar una llave SSH</h4>
<div class="outline-text-4" id="text-orga91b2ee">
<ul class="org-ul">
<li><b><b>Generar una llave SSH</b></b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   ssh-keygen -t ed25519 -C <span style="color: #c3e88d;">"tuemail@ejemplo.com"</span>
</pre>
</div>

<ul class="org-ul">
<li><b><b>Añadir la llave al agente SSH</b></b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   <span style="color: #c099ff;">eval</span> <span style="color: #c3e88d;">"$(ssh-agent -s)"</span>
   ssh-add ~/.ssh/id_ed25519
</pre>
</div>

<ul class="org-ul">
<li><b><b>Copiar la llave pública</b></b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   cat ~/.ssh/id_ed25519.pub
</pre>
</div>

<ul class="org-ul">
<li>Añádela a tu cuenta de GitHub en <b><b>Settings &gt; SSH and GPG keys</b></b>.</li>
</ul>
</div>
</div>
</div>
</div>



<div id="outline-container-org769eea0" class="outline-2">
<h2 id="org769eea0">Graficación por Computadora</h2>
<div class="outline-text-2" id="text-org769eea0">
<p>
La  Graficación por Computadora (o simplemente Graficación)
se enfoca en el estudio y aplicación de técnicas, algoritmos y
herramientas para la generación y manipulación de imágenes digitales
mediante el uso de computadoras. Es una rama de la informática que
combina conceptos de matemáticas, física y programación para crear
imágenes, animaciones y efectos visuales. A continuación, te describo
los aspectos clave de esta disciplina:
</p>
</div>

<div id="outline-container-org535f596" class="outline-3">
<h3 id="org535f596">Objetivos de la Graficación por Computadora</h3>
<div class="outline-text-3" id="text-org535f596">
<ol class="org-ol">
<li><b><b>Generación de imágenes</b></b>: Crear imágenes digitales a partir de descripciones matemáticas y geométricas de objetos, en 2D y 3D.</li>
<li><b><b>Modelado de objetos</b></b>: Crear representaciones matemáticas de objetos y escenas usando técnicas como polígonos, mallas y curvas.</li>
<li><b><b>Renderizado</b></b>: Convertir representaciones matemáticas en imágenes visuales, simulando iluminación, sombras y texturas.</li>
<li><b><b>Transformaciones geométricas</b></b>: Aplicar traslaciones, rotaciones, escalados y proyecciones a objetos en sistemas de coordenadas 2D y 3D.</li>
<li><b><b>Iluminación y sombreado</b></b>: Simular cómo la luz interactúa con los objetos para crear efectos realistas.</li>
<li><b><b>Animación</b></b>: Generar secuencias de imágenes que cambian a lo largo del tiempo, incluyendo movimientos y simulaciones físicas.</li>
<li><b><b>Texturizado</b></b>: Aplicar imágenes (texturas) sobre superficies para dar detalles visuales sin aumentar la complejidad geométrica.</li>
<li><b><b>Interacción gráfica</b></b>: Estudiar técnicas para interactuar con imágenes o modelos gráficos, como interfaces gráficas, realidad aumentada o virtual.</li>
</ol>
</div>
</div>

<div id="outline-container-orgbb6f13f" class="outline-3">
<h3 id="orgbb6f13f">Áreas de estudio en Graficación por Computadora</h3>
<div class="outline-text-3" id="text-orgbb6f13f">
<ol class="org-ol">
<li><b><b>Matemáticas</b></b>: Uso de geometría y álgebra lineal para realizar transformaciones geométricas y modelar objetos.</li>
<li><b><b>Programación</b></b>: Conocimiento de lenguajes como C++, Python, GLSL y HLSL para implementar algoritmos gráficos.</li>
<li><b><b>Algoritmos gráficos</b></b>: Estudio de algoritmos como el trazado de rayos (ray tracing), rasterización y z-buffering.</li>
<li><b><b>Herramientas gráficas</b></b>: Uso de APIs como OpenGL, DirectX o Vulkan para crear gráficos y animaciones.</li>
<li><b><b>Física aplicada</b></b>: Simulación de fenómenos físicos como gravedad y movimiento para generar gráficos realistas.</li>
</ol>
</div>
</div>

<div id="outline-container-orga1547e0" class="outline-3">
<h3 id="orga1547e0">Aplicaciones de la Graficación por Computadora</h3>
<div class="outline-text-3" id="text-orga1547e0">
<ul class="org-ul">
<li><b><b>Videojuegos</b></b>: Creación de ambientes, personajes y efectos visuales.</li>
<li><b><b>Cine y efectos visuales</b></b>: Creación de efectos especiales y animación por computadora.</li>
<li><b><b>Diseño industrial y arquitectónico</b></b>: Modelado y visualización de prototipos y estructuras.</li>
<li><b><b>Simulaciones</b></b>: Uso en medicina, aeronáutica y otras industrias para crear simulaciones realistas.</li>
<li><b><b>Realidad virtual y aumentada</b></b>: Generación de entornos interactivos virtuales.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc82b6b4" class="outline-3">
<h3 id="orgc82b6b4">Temas principales en Graficación por Computadora</h3>
<div class="outline-text-3" id="text-orgc82b6b4">
<ul class="org-ul">
<li><b><b>Modelado 2D y 3D</b></b></li>
<li><b><b>Algoritmos de rasterización</b></b></li>
<li><b><b>Transformaciones y proyecciones</b></b></li>
<li><b><b>Renderizado y sombreado</b></b></li>
<li><b><b>Texturizado</b></b></li>
<li><b><b>Iluminación global y local</b></b></li>
<li><b><b>Técnicas de animación</b></b></li>
<li><b><b>Programación de shaders</b></b></li>
<li><b><b>Interacción gráfica y diseño de interfaces</b></b></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: likcos</p>
<p class="date">Created: 2024-09-04 mié 23:18</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
